Revit 2027 API
ElementFilter.PassesFilter(Document, ElementId) Method
 Applies the filter to a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PassesFilter(
	Document document,
	ElementId id
)
Public Function PassesFilter (
	document As Document,
	id As ElementId
) As Boolean
public:
bool PassesFilter(
	Document^ document,
	ElementId^ id
)
member PassesFilter :
        document : Document *
        id : ElementId -> bool
Parameters
document Document
 The document.
id ElementId
 The element id.
Return Value
Boolean
 True if the element is accepted by the filter. False if the element is rejected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementFilter Class
PassesFilter Overload
Autodesk.Revit.DB Namespace